{"papertitle": "Single underwater image restoration based on adaptive transmission fusion", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8978756/", "paperfrom": "HH Chang - IEEE Access, 2020 - ieeexplore.ieee.org", "abstract": "… through water and the strength of attenuation is color dependent. After constructing a … image \nformation model, this paper proposes a new strategy for single underwater image restoration…"}
{"papertitle": "Underwater image restoration based on image blurriness and light absorption", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7840002/", "paperfrom": "YT Peng, PC Cosman - IEEE transactions on image processing, 2017 - ieeexplore.ieee.org", "abstract": "… depth using image blurriness alone, we use both image blurriness … to date of underwater \nimage restoration techniques, using no-… In Section II, we review underwater image restoration …"}
{"papertitle": "Automated underwater image restoration and retrieval of related optical properties", "paperlink": "https://ieeexplore.ieee.org/abstract/document/4423193/", "paperfrom": "W Hou, DJ Gray, AD Weidemann… - … and remote sensing …, 2007 - ieeexplore.ieee.org", "abstract": "… framework in order to restore underwater imagery to the best possible level, working with \nboth simulated and field measured data. Under this framework, the traditional image restoration …"}
{"papertitle": "Model based image restoration for underwater images", "paperlink": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8791/87911F/Model-based-image-restoration-for-underwater-images/10.1117/12.2021990.short", "paperfrom": "T Stephan, P Frühberger, S Werling… - … , Range Imaging, and …, 2013 - spiedigitallibrary.org", "abstract": "… This paper describes a model based image restoration approach, which is able to restore \nthe visibility of the origin colors. It is derived from the radiation transfer equation,2 thus it …"}
{"papertitle": "Underwater image restoration using color-line model", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8556079/", "paperfrom": "Y Zhou, Q Wu, K Yan, L Feng… - IEEE Transactions on …, 2018 - ieeexplore.ieee.org", "abstract": "… IMAGE RESTORATION METHOD In this section, we propose a color-line based method for \nunderwater image restoration, … the constraints of the underdetermined restoration problem. A …"}
{"papertitle": "Underwater image restoration via maximum attenuation identification", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8039483/", "paperfrom": "N Wang, H Zheng, B Zheng - IEEE Access, 2017 - ieeexplore.ieee.org", "abstract": "… -water light propagation model was proposed several years ago but is relatively complicated \nto be used in reality. In this study, the full underwater … and color restoration validates that our …"}
{"papertitle": "Single underwater image restoration using adaptive attenuation-curve prior", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8049307/", "paperfrom": "Y Wang, H Liu, LP Chau - … on Circuits and Systems I: Regular …, 2017 - ieeexplore.ieee.org", "abstract": "… a novel underwater image restoration method based on a non-… That is, all pixel values of \na clear image can be partitioned … function form after attenuated by water in varying degrees. …"}
{"papertitle": "Estimation-based approach for underwater image restoration", "paperlink": "https://www.osapublishing.org/abstract.cfm?uri=ol-36-13-2384", "paperfrom": "G Wang, B Zheng, FF Sun - Optics letters, 2011 - osapublishing.org", "abstract": "… This Letter presents a new approach for underwater image restoration based on estimation \n… to complete the restoration. To model the PSF of the image formation under water, we …"}
{"papertitle": "Underwater image restoration and enhancement based on a fusion algorithm with color balance, contrast optimization, and histogram stretching", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9359796/", "paperfrom": "W Luo, S Duan, J Zheng - IEEE Access, 2021 - ieeexplore.ieee.org", "abstract": "… This paper proposes a fusion algorithm for underwater image restoration and enhancement, \nin which color balance, contrast optimization and histogram stretching based on red chan…"}
{"papertitle": "Single underwater image restoration by blue-green channels dehazing and red channel correction", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7471973/", "paperfrom": "C Li, J Quo, Y Pang, S Chen… - 2016 IEEE International …, 2016 - ieeexplore.ieee.org", "abstract": "… areas, there is no easy way to have a reference image, which makes underwater images \ndifficult to evaluate. We consider the main goal of image restoration as to emphasize the image …"}
{"papertitle": "Review on underwater image restoration and enhancement algorithms", "paperlink": "https://dl.acm.org/doi/abs/10.1145/2808492.2808548", "paperfrom": "R Wang, Y Wang, J Zhang, X Fu - … of the 7th International Conference on …, 2015 - dl.acm.org", "abstract": "… The serious degradation of underwater image is the result of light scattering by particles… \nimage processing and classify the approaches into two categories: image restoration and image …"}
{"papertitle": "Underwater Image Restoration Based on Adaptive Color Compensation and Dual Transmission Estimation", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9256264/", "paperfrom": "Y Wang, J Cao, S Rizvi, Q Hao, Y Fang - IEEE Access, 2020 - ieeexplore.ieee.org", "abstract": "… To overcome these problems, we propose a novel image restoration method based on … \n(ACDTE) to restore the visibility of underwater images degraded by non-uniform turbid water. The …"}
{"papertitle": "Background light estimation for depth-dependent underwater image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8451400/", "paperfrom": "CY Li, A Cavallaro - … IEEE International Conference on Image …, 2018 - ieeexplore.ieee.org", "abstract": "… of the water region(s). To address this problem, we propose a restoration method that \ncompensates for the colour loss due to the scene-to-camera distance of non-water regions without …"}
{"papertitle": "Underwater image restoration via depth map and illumination estimation based on a single image", "paperlink": "https://www.osapublishing.org/abstract.cfm?uri=oe-29-19-29864", "paperfrom": "J Zhou, T Yang, W Ren, D Zhang, W Zhang - Optics Express, 2021 - osapublishing.org", "abstract": "… poor restoration results. Recently, a revised underwater image formation model (ie, the \nAkkaynak-Treibitz model) has shown better robustness in underwater image restoration, but has …"}
{"papertitle": "Underwater single image restoration using dark channel prior", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7469504/", "paperfrom": "FM Codevilla, SSDC Botelho, P Drews… - 2014 Symposium on …, 2014 - ieeexplore.ieee.org", "abstract": "… possible to recover an haze-free image. But, for this procedure … are able to successfully obtain \nthe restoration of the image. … With this, we propose a single image restoration method with …"}
{"papertitle": "I can see clearly now: Image restoration via de-raining", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8793486/", "paperfrom": "H Porav, T Bruls, P Newman - 2019 International Conference …, 2019 - ieeexplore.ieee.org", "abstract": "… Similarly, we show the same reduction and restoration of performance in the case of … of \nimage restoration, while being able to run in real time. Finally, our system processes the image …"}
{"papertitle": "Underwater Image Restoration via Contrastive Learning and a Real-world Dataset", "paperlink": "https://arxiv.53yu.com/abs/2106.10718", "paperfrom": "J Han, M Shoeiby, T Malthus, E Botha, J Anstee… - arXiv preprint arXiv …, 2021 - arxiv.org", "abstract": "… a large-scale real underwater image dataset, dubbed ‘HICRD’ (… We employ accurate \nwater parameter (diffuse attenuation … image restoration based on unsupervised image-to-image …"}
{"papertitle": "A robust image watermarking based on image restoration using SIFT", "paperlink": "https://www.radioeng.cz/fulltexts/2011/11_02_525_532.pdf", "paperfrom": "H Luo, X Sun, H Yang, Z Xia - Radioengineering, 2011 - radioeng.cz", "abstract": "… In section 2, we describe a synchronization method based on the SIFT and image restoration. \n… and image restoration in our scheme. Image restoration will be introduced in section 2.2. …"}
{"papertitle": "Underwater image restoration using color correction and non-local prior", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8084916/", "paperfrom": "M Wu, K Luo, J Dang, D Li - OCEANS 2017-Aberdeen, 2017 - ieeexplore.ieee.org", "abstract": "… In the paper, we propose a systematic approach for underwater image restoration based \non color correction and nonlocal prior. Specifically, we first remove the color distortion of …"}
{"papertitle": "A hybrid algorithm for underwater image restoration based on color correction and image sharpening", "paperlink": "https://linkspringer.53yu.com/article/10.1007/s00530-020-00693-2", "paperfrom": "H Meng, Y Yan, C Cai, R Qiao, F Wang - Multimedia Systems, 2020 - Springer", "abstract": "… Underwater image restoration is still a challenge work due to color distortion when a … As \nwell known, improving the visibility of underwater image is extremely important for visual surveys…"}
{"papertitle": "De-scattering and edge-enhancement algorithms for underwater image restoration", "paperlink": "https://linkspringer.53yu.com/article/10.1631/FITEE.1700744", "paperfrom": "P Pan, F Yuan, E Cheng - Frontiers of Information Technology & Electronic …, 2019 - Springer", "abstract": "… In this study, we focus on an image restoration algorithm using a single image. Considering \nthat the underwater image degradation model is similar to an atmospheric scattering model, …"}
{"papertitle": "Region-specialized underwater image restoration in inhomogeneous optical environments", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0030402613013843", "paperfrom": "Z Chen, H Wang, J Shen, X Li, L Xu - Optik, 2014 - Elsevier", "abstract": "… In this condition, the popular image processing methods … method for underwater image \nrestoration is proposed in this … for both underwater image enhancement and restoration, the …"}
{"papertitle": "Zero-Shot Single Image Restoration Through Controlled Perturbation of Koschmieder's Model", "paperlink": "http://openaccess.thecvf.com/content/CVPR2021/html/Kar_Zero-Shot_Single_Image_Restoration_Through_Controlled_Perturbation_of_Koschmieders_Model_CVPR_2021_paper.html", "paperfrom": "A Kar, SK Dhara, D Sen… - Proceedings of the IEEE …, 2021 - openaccess.thecvf.com", "abstract": "… In this paper, a zero-shot single real-world image restoration model is proposed leveraging \n… image, to perform image restoration. We show that a suitable degradation of the input image …"}
{"papertitle": "Turbidity underwater image restoration using spectral properties and light compensation", "paperlink": "https://search.ieice.org/bin/summary.php?id=e99-d_1_219", "paperfrom": "H Lu, Y Li, S Nakashima, S Serikawa - IEICE TRANSACTIONS on …, 2016 - search.ieice.org", "abstract": "… objects in water tank. We utilize OLYMPUS uTough 8000 underwater camera, INON LE700-W/S \nunderwater light, … We also apply the proposed method to deep-sea image restoration. …"}
{"papertitle": "Hyperspectral image restoration using low-rank matrix recovery", "paperlink": "https://ieeexplore.ieee.org/abstract/document/6648433/", "paperfrom": "H Zhang, W He, L Zhang, H Shen… - IEEE transactions on …, 2013 - ieeexplore.ieee.org", "abstract": "… As to HSI restoration, the main challenge is the determination of the lowrank components … \n-based image restoration model. In this paper, we propose an HSI restoration technique on the …"}
{"papertitle": "High accuracy image restoration method for seeing through water", "paperlink": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9217/921702/High-accuracy-image-restoration-method-for-seeing-through-water/10.1117/12.2061643.short", "paperfrom": "KK Halder, M Tahtali… - … of Digital Image …, 2014 - spiedigitallibrary.org", "abstract": "… For fair comparison, we employed the same image registration technique for both methods. \nThe image restoration converges in 3 to 4 iterations in both cases. The proposed restoration …"}
{"papertitle": "Single underwater image restoration based on descattering and color correction", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0030402622003825", "paperfrom": "K Ke, C Zhang, Q Tang, Y He, B Yao - Optik, 2022 - Elsevier", "abstract": "… presents an underwater image restoration method based on image descattering and color … \nthe dark channel under different color tones. Instead of calculating the global water light in the …"}
{"papertitle": "Underwater image restoration based on diffraction bounded optimization algorithm with dark channel prior", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0030402619308022", "paperfrom": "A Mathias, D Samiappan - Optik, 2019 - Elsevier", "abstract": "… For image dehazing, the image restoration techniques include many filtering algorithms. \nThe homomorphic filtering [24] reduce the thickness estimated as the distorted layer. Wavelet …"}
{"papertitle": "Single image restoration using scene ambient light differential", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7532699/", "paperfrom": "YT Peng, PC Cosman - … International Conference on Image …, 2016 - ieeexplore.ieee.org", "abstract": "… natural terrestrial images, which motivated many image restoration approaches [3–14] that \n… to under- or over-estimated transmission based on the DCP, causing poor restoration results…"}
{"papertitle": "Underwater Image Restoration via DCP and Yin–Yang Pair Optimization", "paperlink": "https://www.mdpi.com/1526974", "paperfrom": "K Yu, Y Cheng, L Li, K Zhang, Y Liu, Y Liu - Journal of Marine Science …, 2022 - mdpi.com", "abstract": "… A novel underwater image restoration algorithm is proposed in this paper based on the \nDCP and Yin–Yang pair optimization. The algorithm is composed of four important parts: …"}
{"papertitle": "Underwater Single-Image Restoration with Transmission Estimation Using Color Constancy", "paperlink": "https://www.mdpi.com/1543750", "paperfrom": "W Zhang, W Liu, L Li - Journal of Marine Science and Engineering, 2022 - mdpi.com", "abstract": "… image restoration was investigated in this paper. Specifically, the color constancy of a single \nimage … can be used in the image formation model to restore the underwater image. First, the …"}
{"papertitle": "A survey of restoration and enhancement for underwater images", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8932429/", "paperfrom": "W Zhang, L Dong, X Pan, P Zou, L Qin, W Xu - IEEE Access, 2019 - ieeexplore.ieee.org", "abstract": "… , various image restoration and … image restoration and enhancement techniques and \nclassifies the approaches in two categories: image restoration (physical-based model) and image …"}
{"papertitle": "Underwater image restoration based on secondary guided transmission map", "paperlink": "https://linkspringer.53yu.com/article/10.1007/s11042-020-10049-7", "paperfrom": "J Zhou, Z Liu, W Zhang, D Zhang, W Zhang - Multimedia Tools and …, 2021 - Springer", "abstract": "… water and the scattering of suspended particles. So, we propose an underwater image \nrestoration method based on secondary guided transmission map, which can effectively restore …"}
{"papertitle": "Depth and image restoration from light field in a scattering medium", "paperlink": "http://openaccess.thecvf.com/content_iccv_2017/html/Tian_Depth_and_Image_ICCV_2017_paper.html", "paperfrom": "J Tian, Z Murez, T Cui, Z Zhang… - Proceedings of the …, 2017 - openaccess.thecvf.com", "abstract": "… algorithms for image restoration and depth estimation that address the image degradation \n… First, we present a new single image restoration algorithm which removes backscatter and …"}
{"papertitle": "Image restoration with discrete constrained total variation part I: Fast and exact optimization", "paperlink": "https://linkspringer.53yu.com/article/10.1007/s10851-006-8803-0", "paperfrom": "J Darbon, M Sigelle - Journal of Mathematical Imaging and Vision, 2006 - Springer", "abstract": "… minimization problem in image restoration for convex data … Our method relies on the \ndecomposition of an image into its … that minimization of total variation under L1 data fidelity term …"}
{"papertitle": "Recent advances in underwater image restoration technique based on polarimetric imaging", "paperlink": "http://www.irla.cn/en/article/doi/10.3788/IRLA201948.0603006?utm_source=TrendMD&utm_medium=cpc&utm_campaign=Infrared_and_Laser_Engineering_TrendMD_1", "paperfrom": "H Haofeng, L Xiaobo, L Tiegen - 红外与激光工程, 2019 - irla.cn", "abstract": "… efficiently and extensively, such as underwater image restoration and target recognition, etc. \n… and image processing technique, the polarimetric recovery method for image restoration …"}
{"papertitle": "A semi-global color correction for underwater image restoration", "paperlink": "https://dl.acm.org/doi/abs/10.1145/3102163.3102237", "paperfrom": "CO Ancuti, C Ancuti, C De Vleeschouwer… - ACM SIGGRAPH 2017 …, 2017 - dl.acm.org", "abstract": "… Indeed , underwater image restoration is more challenging … our new technique for various \nunderwater images. In Figure 1 … to restore the visibility in underwater compared with UDCP. …"}
{"papertitle": "Hyperspectral image restoration under complex multi-band noises", "paperlink": "https://www.mdpi.com/351066", "paperfrom": "Z Yue, D Meng, Y Sun, Q Zhao - Remote Sensing, 2018 - mdpi.com", "abstract": "… Regarding each band of HSIs as a gray image, we can simply use the traditional image \ndenoising method to reduce noise in a band-by-band fashion, such as the sparse constraint …"}
{"papertitle": "Underwater-GAN: Underwater image restoration via conditional generative adversarial network", "paperlink": "https://linkspringer.53yu.com/chapter/10.1007/978-3-030-05792-3_7", "paperfrom": "X Yu, Y Qu, M Hong - International Conference on Pattern Recognition, 2018 - Springer", "abstract": "… the problem of underwater image restoration. We propose Underwater-GAN based on \nWGAN-GP for underwater image restoration. We construct an underwater image dataset by a …"}
{"papertitle": "Statistical mechanics of image restoration and error-correcting codes", "paperlink": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.60.132", "paperfrom": "H Nishimori, KYM Wong - Physical Review E, 1999 - APS", "abstract": "… We develop a statistical-mechanical formulation for image restoration and error-correcting … \nwith ferromagnetic bias under random external fields. We prove that the quality of restoration/…"}
{"papertitle": "Single underwater image restoration by decomposing curves of attenuating color", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0030399219306395", "paperfrom": "C Dai, M Lin, X Wu, Z Wang, Z Guan - Optics & Laser Technology, 2020 - Elsevier", "abstract": "… is proposed for single underwater image restoration. A novel scoring formula is proposed \nto robustly search for the background area on a single degraded underwater image. Then we …"}
{"papertitle": "Underwater image restoration based on minimum information loss principle and optical properties of underwater imaging", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7532707/", "paperfrom": "C Li, J Guo, S Chen, Y Tang, Y Pang… - … Conference on Image …, 2016 - ieeexplore.ieee.org", "abstract": "… Numerous underwater image restoration and enhancement methods have emerged in \nrecent years. CarlevarisBianco et al. [2] proposed a simple yet effective prior that exploits the …"}
{"papertitle": "Single underwater image restoration based on depth estimation and transmission compensation", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8463523/", "paperfrom": "HH Chang, CY Cheng, CC Sung - IEEE Journal of Oceanic …, 2018 - ieeexplore.ieee.org", "abstract": "… In conclusion, this paper exclusively developed a new underwater image restoration framework \nbased on depth estimation and transmission compensation. To address the unique scat…"}
{"papertitle": "Underwater image restoration based on a new underwater image formation model", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8489952/", "paperfrom": "M Zhang, J Peng - IEEE Access, 2018 - ieeexplore.ieee.org", "abstract": "… However, restoring underwater image from a single image is an odd-ill problem … image, we \npropose an underwater image restoration method. First, we present a new underwater image …"}
{"papertitle": "Variational distance-dependent image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/4270287/", "paperfrom": "R Kaftory, YY Schechner… - 2007 IEEE Conference on …, 2007 - ieeexplore.ieee.org", "abstract": "… A ‘naive’ restoration may attempt to restore the image by amplifying the signal in each pixel \n… A similar effect exists in other media, eg, underwater, where it is called backscatter [9, 21, 22…"}
{"papertitle": "Measurement of a container crane spreader under bad weather conditions by image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/5976447/", "paperfrom": "H Kawai, YB Kim, Y Choi - IEEE Transactions on …, 2011 - ieeexplore.ieee.org", "abstract": "… for image restoration that addresses the problems arising in bad weather, such as mist, \nfog, and rain. Under these conditions, the quality of images is degraded due to small water …"}
{"papertitle": "Underwater image restoration based on a parallel convolutional neural network", "paperlink": "https://www.mdpi.com/491258", "paperfrom": "K Wang, Y Hu, J Chen, X Wu, X Zhao, Y Li - Remote sensing, 2019 - mdpi.com", "abstract": "… (1) We propose a new end-to-end underwater image restoration algorithm using a deep \nCNN model to improve the contrast and color cast of the recovered images. The whole network …"}
{"papertitle": "Generalization of the dark channel prior for single image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8307410/", "paperfrom": "YT Peng, K Cao, PC Cosman - IEEE Transactions on Image …, 2018 - ieeexplore.ieee.org", "abstract": "… image restoration using a new approach to estimating ambient light (which is needed by the \nDCP restoration … In Section II, we review DCP-based image restoration [1] and its limitations. …"}
{"papertitle": "Underwater image restoration via backscatter pixel prior and color compensation", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0952197622000677", "paperfrom": "J Zhou, T Yang, W Chu, W Zhang - Engineering Applications of Artificial …, 2022 - Elsevier", "abstract": "… a new underwater image restoration method based on the revised model. Firstly, a single \nimage was used as input to estimate the depth map and backscatter of the whole image. Then, …"}
{"papertitle": "A simple and comprehensive model for underwater image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/6720385/", "paperfrom": "X Wu, H Li - … IEEE International Conference on Information and …, 2013 - ieeexplore.ieee.org", "abstract": "… Image quality of underwater objects is extremely contaminated and … by the method of image \nrestoration model proposed in this … of underwater image restoration into the following steps: …"}
{"papertitle": "Underwater image restoration using single color channel prior", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7857488/", "paperfrom": "S Borkar, SV Bonde - 2016 International Conference on Signal …, 2016 - ieeexplore.ieee.org", "abstract": "… Abstract—Recovering dehazed image from the single underwater image has always \nbeen a challenging task. Inspired from dark channel prior, we extend it further to dehaze the …"}
{"papertitle": "Underwater image restoration by means of blind deconvolution approach", "paperlink": "https://linkspringer.53yu.com/article/10.1007/s12200-010-0012-1", "paperfrom": "F Fan, K Yang, M Xia, W Li, B Fu, W Zhang - Frontiers of Optoelectronics in …, 2010 - Springer", "abstract": "… 4.1 Restoration result of distinct initial guesses for an object First, we perform image \nrestoration by a blind deconvolution algorithm dealing with the original image directly. With the …"}
{"papertitle": "An efficient nonlocal variational method with application to underwater image restoration", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0925231219311798", "paperfrom": "G Hou, Z Pan, G Wang, H Yang, J Duan - Neurocomputing, 2019 - Elsevier", "abstract": "… In this paper, we present a novel variational method for underwater image restoration \nbased on nonlocal differential operator. Here, we successfully integrate the underwater image …"}
{"papertitle": "DehazeGAN: underwater haze image restoration using unpaired image-to-image translation", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S240589631932172X", "paperfrom": "Y Cho, R Malav, G Pandey, A Kim - IFAC-PapersOnLine, 2019 - Elsevier", "abstract": "… In this paper, we propose an underwater image restoration method using deep generative \nmodels. We utilized cyclic architecture and constructed multiple consistency losses for detail …"}
{"papertitle": "Underwater image restoration based on background light estimation and dark channel prior", "paperlink": "https://www.researching.cn/articles/OJ6f8973cc382313a1", "paperfrom": "H Xie, G Peng, F Wang, C Yang - Acta Optica Sinica, 2018 - researching.cn", "abstract": "… image restoration method under natural light is proposed according to the ocean optics \ndefinition of background light. Optical parameters of water (… image. Finally, the underwater …"}
{"papertitle": "Underwater image restoration via information distribution and light scattering prior", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0045790622001926", "paperfrom": "J Zhou, Y Wang, W Zhang - Computers and Electrical Engineering, 2022 - Elsevier", "abstract": "… To address these degradation issues, we propose a novel underwater image restoration … \nFinally, the underwater image formation model is inversed to obtain the restored image. …"}
{"papertitle": "Underwater image transmission and blurred image restoration", "paperlink": "https://www.spiedigitallibrary.org/journals/Optical-Engineering/volume-40/issue-6/0000/Underwater-image-transmission-and-blurred-image-restoration/10.1117/1.1364500.short", "paperfrom": "Z Liu, Y Yu, K Zhang, H Huang - Optical Engineering, 2001 - spiedigitallibrary.org", "abstract": "… PSF and MTF of the water, we get fairly good results of image restoration using the MTF \nand Wiener filter, while the simple inverse filtering method for image restoration is not practical …"}
{"papertitle": "A dataset to evaluate underwater image restoration methods", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7485524/", "paperfrom": "A Duarte, F Codevilla, JDO Gaya… - OCEANS 2016 …, 2016 - ieeexplore.ieee.org", "abstract": "… the image in unusual ways. This work aims to evaluate how the popular image restoration \n… in the water. For this, we propose a dataset where we are able to control the amount of …"}
{"papertitle": "Underwater image restoration based on improved background light estimation and automatic white balance", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8633271/", "paperfrom": "C Li, X Zhang - 2018 11th International Congress on Image and …, 2018 - ieeexplore.ieee.org", "abstract": "… Image restoration is a main method of underwater image sharpening. According to the prior \nknowledge of light in the process of water … used to complete the image restoration. Grosso [1] …"}
{"papertitle": "Automatic red-channel underwater image restoration", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S1047320314001874", "paperfrom": "A Galdran, D Pardo, A Picón, A Alvarez-Gila - … Communication and Image …, 2015 - Elsevier", "abstract": "… Underwater image restoration can also be considered as a distance-dependent degradation \nproblem. In the last years, this field has experienced a remarkable progress, mainly in …"}
{"papertitle": "Seeing through water: Image restoration using model-based tracking", "paperlink": "https://ieeexplore.ieee.org/abstract/document/5459440/", "paperfrom": "Y Tian, SG Narasimhan - 2009 IEEE 12th International …, 2009 - ieeexplore.ieee.org", "abstract": "… Given the image formation model, we build a water simulator based on Eqn. 3. Our simulator \n… Our method results in better image restoration for severe distortions as shown in Fig. 9. The …"}
{"papertitle": "A rapid scene depth estimation model based on underwater light attenuation prior for underwater image restoration", "paperlink": "https://linkspringer.53yu.com/chapter/10.1007/978-3-030-00776-8_62", "paperfrom": "W Song, Y Wang, D Huang… - Pacific Rim Conference on …, 2018 - Springer", "abstract": "… radiance under the water. In order to evaluate the superiority of underwater image restoration \n… effect with less running time, compared to four state-of-the-art image restoration methods. …"}
{"papertitle": "An experimental-based review of image enhancement and image restoration methods for underwater imaging", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8782094/", "paperfrom": "Y Wang, W Song, G Fortino, LZ Qi, W Zhang… - IEEE …, 2019 - ieeexplore.ieee.org", "abstract": "… of image restoration methods based on … image restoration. (4) We share our lessons-learnt \nfrom working in this area, revealing latent difficulties and problems faced in underwater image …"}
{"papertitle": "Underwater image restoration: A stateoftheart review", "paperlink": "https://www.researchgate.net/profile/Sheezan-Fayaz/publication/347617167_Underwater_image_restoration_A_state-of-the-art_review/links/604f466ea6fdcccfee81b403/Underwater-image-restoration-A-state-of-the-art-review.pdf", "paperfrom": "S Fayaz, SA Parah, GJ Qureshi, V Kumar - IET Image Processing, 2021 - researchgate.net", "abstract": "… We also discuss the issues in different underwater image restoration algorithms leading to \nnew … of image restoration. Section 3 discusses various hardware-based restoration methods. …"}
{"papertitle": "ROV based underwater blurred image restoration", "paperlink": "https://linkspringer.53yu.com/article/10.1007/s11802-003-0033-0", "paperfrom": "L Zhishen, D Tianfu, W Gang - Journal of Ocean University of Qingdao, 2003 - Springer", "abstract": "… the restoration of blurred images through scattering water path … image results demonstrate \nthat the method given in this paper will be of value for ROV systems operating under water…"}
{"papertitle": "An in-depth survey of underwater image enhancement and restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8786104/", "paperfrom": "M Yang, J Hu, C Li, G Rohde, Y Du, K Hu - IEEE Access, 2019 - ieeexplore.ieee.org", "abstract": "… progress in underwater image restoration and enhancement, … of underwater image restoration \nand enhancement. Furthermore… issues of underwater image restoration and enhancement …"}
{"papertitle": "Self-tuning underwater image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/1707999/", "paperfrom": "E Trucco, AT Olmos-Antillon - IEEE Journal of Oceanic …, 2006 - ieeexplore.ieee.org", "abstract": "… image formation models in image processing algorithms. This paper proposes the design of \nan image restoration … well-known, complete underwater image formation model by Jaffe and …"}
{"papertitle": "Deep underwater image restoration and beyond", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9072473/", "paperfrom": "A Dudhane, P Hambarde, P Patil… - IEEE Signal Processing …, 2020 - ieeexplore.ieee.org", "abstract": "… In this letter, we propose a novel end-to-end deep network for underwater image restoration. \nThe … for underwater image enhancement, a new synthetic underwater image database is …"}
{"papertitle": "Offshore underwater image restoration using reflection-decomposition-based transmission map estimation", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8605308/", "paperfrom": "M Yang, A Sowmya, ZQ Wei… - IEEE Journal of Oceanic …, 2019 - ieeexplore.ieee.org", "abstract": "… underwater environments. In contrast, this paper proposes a novel method for underwater \nimage restoration with … optical characteristics priors, a specific offshore underwater restoration …"}
{"papertitle": "Underwater depth estimation and image restoration based on single images", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7426236/", "paperfrom": "PLJ Drews, ER Nascimento… - IEEE computer …, 2016 - ieeexplore.ieee.org", "abstract": "… study about the prior with applications to image restoration and depth estimation. Furthermore, \nwe provide new results of image restoration using qualitative and quantitative analysis. …"}
{"papertitle": "GUDCP: Generalization of Underwater Dark Channel Prior for Underwater Image Restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9541354/", "paperfrom": "Z Liang, X Ding, Y Wang, X Yan… - IEEE Transactions on …, 2021 - ieeexplore.ieee.org", "abstract": "… an underwater image enhancement method … image. Extensive experiments on real-world \nimages demonstrate that the proposed method outperforms several previous image restoration …"}
{"papertitle": "An iterative regularization method for total variation-based image restoration", "paperlink": "https://epubs.siam.org/doi/abs/10.1137/040605412", "paperfrom": "S Osher, M Burger, D Goldfarb, J Xu, W Yin - Multiscale Modeling & …, 2005 - SIAM", "abstract": "… We are motivated by the following classical problem in image restoration: Given a noisy \nimage f : Ω → R, where Ω is a bounded open subset of R2, we want to obtain a decomposition, …"}
{"papertitle": "Comparison of point spread models for underwater image restoration", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0030402611002774", "paperfrom": "Y Chen, M Xia, W Li, X Zhang, K Yang - Optik, 2012 - Elsevier", "abstract": "… theory or image itself … of image restoration, we can derive PSF from empirical point spread \nmodels or measure the PSF [9] first and then process the degraded images by blind restoration…"}
{"papertitle": "Omnidirection image restoration based on spherical perspective projection", "paperlink": "https://ieeexplore.ieee.org/abstract/document/4746174/", "paperfrom": "B Zhang, Z Qi, J Zhu, Z Cao - APCCAS 2008-2008 IEEE Asia …, 2008 - ieeexplore.ieee.org", "abstract": "… A method for correction of such distorted image is derived in … the fisheye image to perspective \nprojection image by using … model from fisheye image to perspective projection image. In …"}
{"papertitle": "Content-aware image restoration: pushing the limits of fluorescence microscopy", "paperlink": "https://wwwnature.53yu.com/articles/s41592-018-0216-7", "paperfrom": "M Weigert, U Schmidt, T Boothe, A Müller, A Dibrov… - Nature …, 2018 - nature.com", "abstract": "… In this work we show how content-aware image restoration based on deep learning extends \nthe range of biological phenomena observable by microscopy. We demonstrate on eight …"}
{"papertitle": "Single underwater image restoration using attenuation-curve prior", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8050994/", "paperfrom": "Y Wang, H Liu, LP Chau - 2017 IEEE International Symposium …, 2017 - ieeexplore.ieee.org", "abstract": "… restoration in the underwater environment. In this paper, we propose a novel underwater \nimage restoration … This prior relies on the observation that colors of a clear image can be well …"}
{"papertitle": "HybrUR: A Hybrid Physical-Neural Solution for Unsupervised Underwater Image Restoration", "paperlink": "https://arxiv.53yu.com/abs/2107.02660", "paperfrom": "S Yan, X Chen, Z Wu, J Wang, Y Lu, M Tan… - arXiv preprint arXiv …, 2021 - arxiv.org", "abstract": "… RELATED WORKS In order to assess our contribution in relation to the vast literature on \nunderwater image restoration and quality enhancement in a deep learning manner, it is …"}
{"papertitle": "Multi-scale adversarial network for underwater image restoration", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S003039921830690X", "paperfrom": "J Lu, N Li, S Zhang, Z Yu, H Zheng, B Zheng - Optics & Laser Technology, 2019 - Elsevier", "abstract": "… an underwater image restoration method based on transferring an underwater style image \ninto a … the detail structural to improve the image restoration performance. We use dark channel …"}
{"papertitle": "Review of underwater image restoration algorithms", "paperlink": "https://ieeexplore.ieee.org/iel7/4149689/8826721/08826758.pdf", "paperfrom": "PE Abas, LC De Silva - IET Image Processing, 2019 - ieeexplore.ieee.org", "abstract": "… A comparative study of various methods used for underwater image restoration is presented \nin this paper. Earlier methods consist of hardware elements such as polarisers, sensors, …"}
{"papertitle": "Underwater image restoration based on color correction and red channel prior", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8616671/", "paperfrom": "G Huo, Z Wu, J Li - … on systems, man, and cybernetics (SMC), 2018 - ieeexplore.ieee.org", "abstract": "… of the water, the color cast caused by the absorption of the water, and the uneven illumination \nof the light source, this paper presents a new underwater image restoration method based …"}
{"papertitle": "Noise estimation in a noise-adjusted principal component transformation and hyperspectral image restoration", "paperlink": "https://wwwtandfonline.53yu.com/doi/abs/10.5589/m08-013", "paperfrom": "B Xu, P Gong - Canadian Journal of Remote Sensing, 2008 - Taylor & Francis", "abstract": "… in the section entitled Hyperspectral image restoration. … image by Equation (13). We then \ncompare the correlation matrix before (Figure 2a) and after (Figure 2b) the image restoration. …"}
{"papertitle": "An Image Restoration Method for Outdoor and Its Application to Under Water Using Improved Transmission Map and Airlight Estimation", "paperlink": "https://linkspringer.53yu.com/chapter/10.1007/978-981-15-3992-3_6", "paperfrom": "D Eesha - Advances in Communication Systems and Networks, 2020 - Springer", "abstract": "… an important image restoration technique to remove the presence of Haze from a hazy image. \n… Initially, multiple image dehazing methods are used to remove Haze and these dehazing …"}
{"papertitle": "Unsupervised and Untrained Underwater Image Restoration Based on Physical Image Formation Model", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9746292/", "paperfrom": "S Chai, Z Fu, Y Huang, X Tu… - ICASSP 2022-2022 IEEE …, 2022 - ieeexplore.ieee.org", "abstract": "… underwater image restoration method based on the layer disentanglement and the underwater \nimage formation model. Specifically, our network disentangles an underwater image into …"}
{"papertitle": "Underwater image restoration by structured light and flood light imaging", "paperlink": "https://www.osapublishing.org/abstract.cfm?uri=ao-60-23-6928", "paperfrom": "B Gong, G Wang - Applied Optics, 2021 - osapublishing.org", "abstract": "… of the scene and degrades the sharpness of the image. Numerous methods of underwater \nimage enhancement and underwater image restoration have been proposed in decades [2–…"}
{"papertitle": "An image restoration method based on cross-correlation", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8343734/", "paperfrom": "Y Hu, Y Xu - 2017 6th International Conference on Computer …, 2017 - ieeexplore.ieee.org", "abstract": "… In this paper, an image restoration method in video sequences based on cross-correlation is \nproposed. … that the method can eliminate interference and enhance image quality efficiently. …"}
{"papertitle": "Single-shot underwater image restoration: A visual quality-aware method based on light propagation model", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S1047320318301421", "paperfrom": "W Barros, ER Nascimento, WV Barbosa… - … and Image …, 2018 - Elsevier", "abstract": "… , we address the chromatic degradation by weighting each color channel using the \nimage luminance. Even simpler, our method proved to be effective in the image restoration. …"}
{"papertitle": "Inertial selfadaptive algorithm for solving split feasible problems with applications to image restoration", "paperlink": "https://onlinelibrarywiley.53yu.com/doi/abs/10.1002/mma.5836", "paperfrom": "R Suparatulatorn, P Charoensawan… - … Methods in the …, 2019 - Wiley Online Library", "abstract": "… for applications to image restoration problems. In order to study an image restoration, we \nconsider … Moreover, numerical results of image restoration problems illustrate that the proposed …"}
{"papertitle": "Sparse representation for color image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/4392496/", "paperfrom": "J Mairal, M Elad, G Sapiro - IEEE Transactions on image …, 2007 - ieeexplore.ieee.org", "abstract": "… color image restoration, and presented results for color image denoising, inpainting, and \ndemosaicing. The framework is based on learning models for sparse color image representation…"}
{"papertitle": "A fourth order dual method for staircase reduction in texture extraction and image restoration problems", "paperlink": "https://ieeexplore.ieee.org/abstract/document/5653199/", "paperfrom": "TF Chan, S Esedoglu, F Park - … Conference on Image …, 2010 - ieeexplore.ieee.org", "abstract": "… a new staircase reducing texture decomposition model of image processing. The proposed \nmodel incor… into many popular texture extraction and restoration models of image processing. …"}
{"papertitle": "Image restoration in radioisotopic imaging systems", "paperlink": "https://iopscience.iop.org/article/10.1088/0031-9155/12/4/005/meta", "paperfrom": "TA Iinuma, T Nagai - Physics in Medicine & Biology, 1967 - iopscience.iop.org", "abstract": "… (4) we can also recognize that image restoration is theoretically possible by taking the … \nunder certain circumstances. The purpose of image restoration is to make a blurred image more …"}
{"papertitle": "A review of image restoration based image defogging algorithms", "paperlink": "https://www.mecs-press.org/ijigsp/ijigsp-v9-n11/IJIGSP-V9-N11-7.pdf", "paperfrom": "B Bansal, JS Sidhu, K Jyoti - International Journal of Image …, 2017 - mecs-press.org", "abstract": "… A number of single image and multiple image restoration based image defogging … present \nstate of the art image defogging algorithms. Firstly, an image classification algorithm has been …"}
{"papertitle": "Optical Imaging and Image Restoration Techniques for Deep Ocean Mapping: A Comprehensive Survey", "paperlink": "https://linkspringer.53yu.com/article/10.1007/s41064-022-00206-y", "paperfrom": "Y Song, D Nakath, M She, K Köser - PFG–Journal of Photogrammetry …, 2022 - Springer", "abstract": "… While image … image (Mangeruga et al. 2018), ie human visual inspection. Therefore, \nthis section does not focus on image enhancement but primarily surveys image restoration …"}
{"papertitle": "Two-stage underwater image restoration based on a physical model", "paperlink": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/10225/102250R/Two-stage-underwater-image-restoration-based-on-a-physical-model/10.1117/12.2266488.short", "paperfrom": "N Wang, L Qi, J Dong, H Fan… - … on Graphic and Image …, 2017 - spiedigitallibrary.org", "abstract": "… In this paper we proposed an effective two-stage method of underwater image restoration. \nTo … The image restoration method with single input image requires some regions of dark …"}
{"papertitle": "Image restoration of damaged or erased manuscripts", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7080683/", "paperfrom": "KT Knox, RL Easton… - 2008 16th European …, 2008 - ieeexplore.ieee.org", "abstract": "… In the top image, in Figure 1, the right-hand side of the parchment is darkened from exposure \nto water, making the text characters hard to read. We found that a simple image processing …"}
{"papertitle": "Order statistic-neural network hybrid filters for gamma camera-bremsstrahlung image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/222667/", "paperfrom": "W Qian, M Kallergi, LP Clarke - IEEE transactions on medical …, 1993 - ieeexplore.ieee.org", "abstract": "… Image restoration filters have been proposed to improve quantitative measurements [2]-[5] \nand … class of restoration filters is constructed aiming primarily at image count restoration. The …"}
{"papertitle": "Underwater image restoration by red-dark channel prior and point spread function deconvolution", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7412173/", "paperfrom": "CY Cheng, CC Sung, HH Chang - … on signal and image …, 2015 - ieeexplore.ieee.org", "abstract": "… restoration algorithm is promising in many underwater image … Many existing underwater \nimage restoration methods … By travelling the light from the source to the image plane of the …"}
{"papertitle": "A novel underwater image restoration method based on decomposition network and physical imaging model", "paperlink": "https://onlinelibrarywiley.53yu.com/doi/abs/10.1002/int.22806", "paperfrom": "Y Cui, Y Sun, M Jian, X Zhang, T Yao… - … Journal of Intelligent …, 2021 - Wiley Online Library", "abstract": "… In recent years, deep learning methods 9-11 have been gradually used in image restoration \n… develop an efficient network for underwater image restoration, which can accurately handle …"}
{"papertitle": "Hyperspectral image restoration using low-rank tensor recovery", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7974741/", "paperfrom": "H Fan, Y Chen, Y Guo, H Zhang… - IEEE Journal of Selected …, 2017 - ieeexplore.ieee.org", "abstract": "… We denote this restoration method as RPCA+VBM3D. In the experiments, we tune the … \nfactorization for hyperspectral image restoration,” IEEE Trans. Geosci. Remote Sens., vol. …"}
{"papertitle": "Heavy rain image restoration: Integrating physics model and conditional adversarial learning", "paperlink": "http://openaccess.thecvf.com/content_CVPR_2019/html/Li_Heavy_Rain_Image_Restoration_Integrating_Physics_Model_and_Conditional_Adversarial_CVPR_2019_paper.html", "paperfrom": "R Li, LF Cheong, RT Tan - … of the IEEE/CVF Conference on …, 2019 - openaccess.thecvf.com", "abstract": "… Application In order to provide the evidence that our image restoration method will benefit \noutdoor computer vision applications, we employ Google Vision API object recognition system …"}
{"papertitle": "Class 1 and Class 2 Underwater Image Enhancement and Restoration Under Turbidity Conditions", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9576782/", "paperfrom": "MK Awang, HS Aminuddin, NKM Kamil… - … on Signal and Image …, 2021 - ieeexplore.ieee.org", "abstract": "… water. The images undergo Histogram equalization (HE) and are filtered with a Wiener filter \nfor image enhancement and image restoration… is image enhancement and image restoration. …"}
{"papertitle": "Spectral CT image restoration via an average image-induced nonlocal means filter", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7239569/", "paperfrom": "D Zeng, J Huang, H Zhang, Z Bian… - IEEE Transactions …, 2015 - ieeexplore.ieee.org", "abstract": "… in conventional low-dose CT image restoration [24] and the HYPR-LR algorithm in SCT \nimage restoration [3], in this study, we propose an average imageinduced non-local means (…"}
{"papertitle": "Underwater Image Restoration and Enhancement via Residual Two-Fold Attention Networks.", "paperlink": "https://www.researchgate.net/profile/Bo-Fu-6/publication/346015203_Underwater_Image_Restoration_and_Enhancement_via_Residual_Two-Fold_Attention_Networks/links/5fb611bd299bf104cf5ad003/Underwater-Image-Restoration-and-Enhancement-via-Residual-Two-Fold-Attention-Networks.pdf", "paperfrom": "B Fu, L Wang, R Wang, S Fu, F Liu… - Int. J. Comput. Intell. Syst …, 2021 - researchgate.net", "abstract": "… Our goal is to apply our neural network to learn the mapping function to achieve automatic \nunderwater image restoration and enhancement. The minimization form of the objective …"}
{"papertitle": "Sustainability reporting after the Costa Concordia disaster: a multi-theory study on legitimacy, impression management and image restoration", "paperlink": "https://www.emerald.com/insight/content/doi/10.1108/AAAJ-05-2018-3488/full/html", "paperfrom": "L Corazza, E Truant, SD Scagnelli… - Accounting, Auditing & …, 2020 - emerald.com", "abstract": "… The aim of the current study was to examine how legitimacy theory, image restoration theory \nand impression management acted in a concrete instance. Based on the content analysis, …"}
{"papertitle": "Hyperspectral image restoration by tensor fibered rank constrained optimization and plug-and-play regularization", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9314228/", "paperfrom": "YY Liu, XL Zhao, YB Zheng, TH Ma… - IEEE Transactions on …, 2021 - ieeexplore.ieee.org", "abstract": "… [58] utilized the NSS to group similar cubes to third-order noisy tensors, and then used \nthe nonnegative Tucker decomposition to solve the task of image restoration. In [59], the low-…"}
{"papertitle": "Hyperspectral Image Restoration via Global L1-2 Spatial–Spectral Total Variation Regularized Local Low-Rank Tensor Recovery", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9144237/", "paperfrom": "H Zeng, X Xie, H Cui, H Yin… - IEEE Transactions on …, 2020 - ieeexplore.ieee.org", "abstract": "… Zhang, “Hyperspectral image restoration via mixture total variation regularization and weighted \nnuclear … total variation in image restoration,” IEEE Trans. Image Process., vol. 5, no. 6, pp. …"}
{"papertitle": "Photoacoustic Tomography image restoration with measured spatially variant point spread functions", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9420701/", "paperfrom": "L Qi, J Wu, X Li, S Zhang, S Huang… - … on Medical Imaging, 2021 - ieeexplore.ieee.org", "abstract": "… the PAT image with these PSFs could restore image resolution and recover object details. \nPrevious PAT image restoration … a PAT image restoration method to improve image quality and …"}
{"papertitle": "RETRACTED ARTICLE: Seawater microbial environment detection and coastal port logistics management based on fuzzy image restoration", "paperlink": "https://linkspringer.53yu.com/article/10.1007/s12517-021-07858-x", "paperfrom": "Z Chen - Arabian Journal of Geosciences, 2021 - Springer", "abstract": "… blurred image restoration. The article first introduces the principles of image blur and restoration \nand summarizes the classical techniques of blurred image restoration (Sun et al. 2019). …"}
{"papertitle": "Application of blind deconvolution approach with image quality metric in underwater image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/5476122/", "paperfrom": "F Fan, K Yang, B Fu, M Xia… - … Image Analysis and Signal …, 2010 - ieeexplore.ieee.org", "abstract": "… The weak point of our approach lies to automatic image restoration, which will be further \nstudied in our future work. More study of the noise generation and its reduction method of range …"}
{"papertitle": "A real-time stereo vision system for distance measurement and underwater image restoration", "paperlink": "https://linkspringer.53yu.com/article/10.1007/s40430-016-0596-5", "paperfrom": "C Sánchez-Ferreira, JY Mori, MCQ Farias… - Journal of the Brazilian …, 2016 - Springer", "abstract": "… for both distance measurement and image restoration, using a hardware/… image restoration \narchitecture, using a low complex restoration algorithm that does not incur in loss of image …"}
{"papertitle": "Sparse learned representations for image restoration", "paperlink": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.150.7999&rep=rep1&type=pdf", "paperfrom": "J Mairal, M Elad, G Sapiro - Proc. of the 4th World Conf. of the Int. Assoc …, 2008 - Citeseer", "abstract": "… (2008a)), for some very difficult regions of some images, our generic color image restoration \nmethod, when applied to demosaicking, does not give visually better results than the best …"}
{"papertitle": "Diving into haze-lines: Color restoration of underwater images", "paperlink": "https://www.eng.tau.ac.il/~berman/UnderwaterColorRestoration/UnderwaterHazeLines_BMVC2017.pdf", "paperfrom": "D Berman, T Treibitz, S Avidan - Proc. British Machine Vision …, 2017 - eng.tau.ac.il", "abstract": "… a wrong water type results in distorted colors. Our results demonstrate a successful single \nimage restoration of underwater scenes using a comprehensive physical image formation …"}
{"papertitle": "Distorted image restoration via non-rigid registration and lucky-region fusion approach", "paperlink": "https://ieeexplore.ieee.org/abstract/document/6747580/", "paperfrom": "B Yang, W Zhang, Y Xie, Q Li - 2013 IEEE Third International …, 2013 - ieeexplore.ieee.org", "abstract": "… In iteration 2-4, our results are nearly converged and image distortion caused by water \ndisturbance is strongly eliminated. In O.Oreifej’s, most distortion is cleared, yet some can still be …"}
{"papertitle": "Agcyclegan: Attention-Guided Cyclegan for Single Underwater Image Restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9746215/", "paperfrom": "Z Wang, W Liu, Y Wang, B Liu - ICASSP 2022-2022 IEEE …, 2022 - ieeexplore.ieee.org", "abstract": "… image restoration model. We focus not only on the performance of image restoration but also \n… between the generated image and the original image. The recovery effect is shown in Fig.1. …"}
{"papertitle": "Multi-objective differential evolution algorithm for underwater image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7256898/", "paperfrom": "C Sánchez-Ferreira, HVH Ayala… - 2015 IEEE Congress …, 2015 - ieeexplore.ieee.org", "abstract": "… The main contribution of this work consist of the novel use of the MODE algorithm in \nimage restoration problem applied for underwater case, and the use of adequate metrics as …"}
{"papertitle": "Under Water Image Restoration", "paperlink": "https://irejournals.com/formatedpaper/1700232.pdf", "paperfrom": "NSAI TEJA, NL NARAYANA, SAI KRISHNA, Y SAGAR… - 2018 - irejournals.com", "abstract": "… image restoration, we have proposed to exploit image … method can produce better restoration \nand enhancement results in … to other IFM-based underwater image restoration methods. …"}
{"papertitle": "Image restoration of arbitrarily warped documents", "paperlink": "https://ieeexplore.ieee.org/abstract/document/1323798/", "paperfrom": "MS Brown, WB Seales - IEEE Transactions on pattern analysis …, 2004 - ieeexplore.ieee.org", "abstract": "… Image restoration in the camera’s image plane. Image restoration in the camera’s image … , \nMi, correspond to their position in the original image at mi. The flattening process moves these …"}
{"papertitle": "Underwater image restoration based on contrast enhancement", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7868625/", "paperfrom": "H Liu, LP Chau - 2016 IEEE International Conference on …, 2016 - ieeexplore.ieee.org", "abstract": "… As the blue color is able to penetrate the longest distance in water, the underwater images \n… image restoration method which tries to restore the underwater images based on the image …"}
{"papertitle": "High-order total bounded variation model and its fast algorithm for Poissonian image restoration", "paperlink": "https://www.hindawi.com/journals/mpe/2019/2502731/", "paperfrom": "J Zhang, M Ma, Z Wu, C Deng - Mathematical Problems in …, 2019 - hindawi.com", "abstract": "… In this paper, a new model for image restoration under Poisson noise based on a high-order \ntotal bounded variation is proposed. Existence and uniqueness of its solution are proved. …"}
{"papertitle": "Learning-Based Dark and Blurred Underwater Image Restoration", "paperlink": "https://www.hindawi.com/journals/complexity/2020/6549410/", "paperfrom": "Y Xu, H Wang, GD Cooper, S Rong, W Sun - Complexity, 2020 - hindawi.com", "abstract": "… image restoration relies on a single image. e categories of single underwater image restoration \n… Traditional methods include image enhancement and restoration and aim at improving …"}
{"papertitle": "Image enhancement and image restoration for old document image using genetic algorithm", "paperlink": "https://ieeexplore.ieee.org/abstract/document/5675834/", "paperfrom": "H Deborah, AM Arymurthy - 2010 Second International …, 2010 - ieeexplore.ieee.org", "abstract": "… The proposed implementation of the genetic algorithm for image enhancement and \nimage restoration is presented in this section. The flow diagram is shown in Fig. 1 and each …"}
{"papertitle": "Unveiling of How Image Restoration Contributes to Underwater Object Detection", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9602998/", "paperfrom": "WY Peng, YT Peng, WC Lien… - 2021 IEEE International …, 2021 - ieeexplore.ieee.org", "abstract": "… visual quality changed by image restoration and deeplearning… find that exploiting underwater \nimage restoration through data … 1, we test image restoration on underwater object detection …"}
{"papertitle": "System of remote-operated-vehicle-based underwater blurred image restoration", "paperlink": "https://www.spiedigitallibrary.org/journals/optical-engineering/volume-46/issue-11/116002/System-of-remote-operated-vehicle-based-underwater-blurred-image-restoration/10.1117/1.2802169.short", "paperfrom": "Y Yu, F Liu - Optical Engineering, 2007 - spiedigitallibrary.org", "abstract": "… that the laser beam and image transmission in water can be described using the … image \ntransmission properties through the water body. Considering the technique of image restoration, …"}
{"papertitle": "Dark Channel and Laplace Based Under Water Image Restoration", "paperlink": "https://ijsret.com/wp-content/uploads/2018/11/IJSRET_V4_issue6_398.pdf", "paperfrom": "MTSS Shrivastav, P Jha - 2018 - ijsret.com", "abstract": "… base distortion detection with dark channel technique for image restoration. Combination … \nthe digital hazy image restoration. Here image store the edge region of the image then applies …"}
{"papertitle": "Multi-scale iterative network for underwater image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8901915/", "paperfrom": "M Hong, Y Qu, C Li, S Chen - 2019 2nd China Symposium on …, 2019 - ieeexplore.ieee.org", "abstract": "… To evaluate the performance of the proposed underwater image restoration method, we \nuse PSNR and SSIM for quantitative assessment which requires clear reference images. In …"}
{"papertitle": "Underwater image restoration based on light absorption", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8697518/", "paperfrom": "BP Hanmante, M Ingle - 2018 Fourth International Conference …, 2018 - ieeexplore.ieee.org", "abstract": "… novel underwater image restoration and enhancement … image blurriness as well as light \nabsorption. To improve the processing speed as well as image quality we proposed novel image …"}
{"papertitle": "Underwater image restoration based on color cast removal and dark channel prior", "paperlink": "https://jeit.ac.cn/en/article/2015/11", "paperfrom": "Y Ai-ping, Z Jia, W Jian, H Yu-qing - Journal of Electronics & Information …, 2015 - jeit.ac.cn", "abstract": "… image is similar to the haze image. However, the dehazing methods fail when used in the \nunderwater image restoration … by the selective absorption of water and light scattering. Thus, …"}
{"papertitle": "Hyperspectral image restoration via total variation regularized low-rank tensor decomposition", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8233403/", "paperfrom": "Y Wang, J Peng, Q Zhao, Y Leung… - IEEE Journal of …, 2017 - ieeexplore.ieee.org", "abstract": "… Encouraged by the powerfulness of TV regularization in various image restoration tasks, \nHeet al.[17] integrated the band-by-band TV regularization into a rank-constrained RPCA model …"}
{"papertitle": "Hyperspectral image restoration using weighted group sparsity-regularized low-rank tensor decomposition", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8822607/", "paperfrom": "Y Chen, W He, N Yokoya… - IEEE transactions on …, 2019 - ieeexplore.ieee.org", "abstract": "… Furthermore, we present the spectral signatures of the restoration results compared with \nthe original image to further report the qualitative comparison. To show the performance …"}
{"papertitle": "Underwater Image Restoration Using Fusion and Wavelet Transform Strategy.", "paperlink": "https://www.researchgate.net/profile/Rashid-Khan-15/publication/331019970_Underwater_Image_Restoration_Using_Fusion_and_Wavelet_Transform_Strategy/links/5c616a32a6fdccb608b7c547/Underwater-Image-Restoration-Using-Fusion-and-Wavelet-Transform-Strategy.pdf", "paperfrom": "R Khan - J. Comput., 2015 - researchgate.net", "abstract": "… Image restoration involves the recovery of the actual image. This is nothing but trying to get \nback the original image … the problem of underwater image restoration. Several input images …"}
{"papertitle": "Underwater polarization image restoration based on logarithmic transformation and dark channel", "paperlink": "https://linkspringer.53yu.com/article/10.1007/s11801-020-9135-9", "paperfrom": "X Liu, J Zhang, Y Yin, Y Yang, C Zhang, X Wu - Optoelectronics Letters, 2020 - Springer", "abstract": "… polarization image restoration. He et al[19] proposed a dark channel prior theory for restoration \n… proposes a new underwater polarization image restoration method based on logarithmic …"}
{"papertitle": "Criteria for the use of digital technology in moving image restoration", "paperlink": "https://muse.jhu.edu/article/219759/summary", "paperfrom": "J Wallmüller - The Moving Image, 2007 - muse.jhu.edu", "abstract": "… relation to two aspects of moving image restoration: the material aspect, ie the restored \nobject (authentic work), and the immaterial aspect, ie the restored image (authentic restoration). …"}
{"papertitle": "Underwater image restoration via feature priors to estimate background light and optimized transmission map", "paperlink": "https://www.osapublishing.org/abstract.cfm?uri=oe-29-18-28228", "paperfrom": "J Zhou, Y Wang, W Zhang, C Li - Optics Express, 2021 - osapublishing.org", "abstract": "… in water medium. To address these two degradation issues, we propose an underwater \nimage restoration … Next, we compensate the red channel of color corrected image to revise the …"}
{"papertitle": "Underwater image restoration based on improved dark channel prior", "paperlink": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11763/117633P/Underwater-image-restoration-based-on-improved-dark-channel-prior/10.1117/12.2586656.short", "paperfrom": "Y Wang, J Cao, M Tang, G Li, Q Hao… - Seventh Symposium on …, 2021 - spiedigitallibrary.org", "abstract": "… restored by this method still has the color distortion problem due to the water absorption, … \nan image restoration method based on improved dark channel prior to repair the image …"}
{"papertitle": "Degraded image restoration based on quadtree decomposition in scattering media", "paperlink": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11566/1156605/Degraded-image-restoration-based-on-quadtree-decomposition-in-scattering-media/10.1117/12.2574335.short", "paperfrom": "Y Wang, J Cao, C Xu, C Xu… - AOPC 2020: Optical …, 2020 - spiedigitallibrary.org", "abstract": "… verify the image restoration ability and robustness of the proposed method, we performed \nthe degraded image restoration under different scattering media (ie smoky media, turbid water)…"}
{"papertitle": "A robust PCA approach with noise structure learning and spatial–spectral low-rank modeling for hyperspectral image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8454794/", "paperfrom": "W Cao, K Wang, G Han, J Yao… - IEEE Journal of Selected …, 2018 - ieeexplore.ieee.org", "abstract": "… 12 and 13, we present the restoration results of bands 103 and 220 by all the compared \nmethods. As for BM4D, it would oversmooth the image and, meanwhile, impair the image …"}
{"papertitle": "Weighted Hyper-Laplacian Prior with Overlapping Group Sparsity for Image Restoration under Cauchy Noise", "paperlink": "https://linkspringer.53yu.com/article/10.1007/s10915-021-01461-8", "paperfrom": "K Jon, J Liu, X Wang, W Zhu, Y Xing - Journal of Scientific Computing, 2021 - Springer", "abstract": "… image restoration problem under the maximum a posteriori framework. We propose a novel \nimage prior, weighted hyper-Laplacian prior with overlapping group sparsity on the image …"}
{"papertitle": "Hyperspectral image restoration using framelet-regularized low-rank nonnegative matrix factorization", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0307904X1830297X", "paperfrom": "Y Chen, TZ Huang, XL Zhao, LJ Deng - Applied Mathematical Modelling, 2018 - Elsevier", "abstract": "… matrix factorization model is proposed for hyperspectral image restoration. … in the image, \nrespectively. To overcome these limitations, in this work, we propose a novel HSI restoration …"}
{"papertitle": "Multi-frame underwater image restoration", "paperlink": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8185/81850O/Multi-frame-underwater-image-restoration/10.1117/12.898914.short", "paperfrom": "AV Kanaev, W Hou, S Woods - Electro-Optical and Infrared …, 2011 - spiedigitallibrary.org", "abstract": "… Detection of such high-resolution areas and their fusion into a single higher quality image \nrepresents the essence of this image restoration approach. The major differences between …"}
{"papertitle": "An improved Richardson-Lucy iterative algorithm for C-scan image restoration and inclusion size measurement", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0041624X1730954X", "paperfrom": "D Chen, H Xiao, J Xu - Ultrasonics, 2019 - Elsevier", "abstract": "… C-scan image of immersion ultrasonic … image restoration method that is based on the \nRichardson-Lucy (RL) iterative algorithm is proposed, which is used to restore the C-scan image …"}
{"papertitle": "Underwater image synthesis from RGB-D images and its application to deep underwater image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8803195/", "paperfrom": "T Ueda, K Yamada, Y Tanaka - … Conference on Image …, 2019 - ieeexplore.ieee.org", "abstract": "… image restoration (UWIR) … water types that reflect attenuation coefficients in absorption and \nscattering processes, spectral responses of photosensors, the vertical distance from the water …"}
{"papertitle": "A Regularization Blind Image Restoration Technique by Using Particle Swarm Optimization", "paperlink": "https://www.atlantis-press.com/article/10473.pdf", "paperfrom": "L Xuanhua, H Qingping, K Xiaojian… - … Technology (ICMT 2013 …, 2013 - atlantis-press.com", "abstract": "… Then, we compared the image restoration result of each algorithms and adopted signal-to-noise \nratio increment ISNR to objectively measure the performance of each blind restoration …"}
{"papertitle": "Improving quantitative neutron radiography through image restoration", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0168900213009893", "paperfrom": "DS Hussey, KJ Coakley, E Baltic… - Nuclear Instruments and …, 2013 - Elsevier", "abstract": "… image (including the flatfield) through an image restoration algorithm. As shown in Kramer et \nal. [5], image restoration yields better estimates for the water … cell with high water thickness (…"}
{"papertitle": "Single image restoration for participating media based on prior fusion", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8663517/", "paperfrom": "JF de Oliveira Gaya, A Duarte… - IEEE Computer …, 2019 - ieeexplore.ieee.org", "abstract": "… In this context, we propose an automatic single image restoration method designed to deal \nwith images acquired in participating media, mainly underwater and hazy environments. We …"}
{"papertitle": "Underwater Image Restoration Based on Color Attenuation Prior and White Balance", "paperlink": "http://www.c-a-m.org.cn/EN/10.3969/j.issn.10062475.2018.04.009", "paperfrom": "HAN Hui - Computer and Modernization, 2018 - cam.org.cn", "abstract": "… in water, and the different attenuation degrees of light at different wavelengths under water, \nthe … Aiming to improve the quality of underwater images, an underwater image restoration …"}
{"papertitle": "Power spectrum equalization for ultrasonic image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/19154/", "paperfrom": "D Iraca, L Landini, L Verrazzani - IEEE transactions on …, 1989 - ieeexplore.ieee.org", "abstract": "… initially describe the image formation process; we then derive the expression of the restoration \nfilter, discusing the assumptions for its validity. Finally we show results of restoration for a …"}
{"papertitle": "Single underwater image restoration based on adaptive color correction and adaptive transmission fusion", "paperlink": "https://www.spiedigitallibrary.org/journals/Journal-of-Electronic-Imaging/volume-29/issue-4/043006/Single-underwater-image-restoration-based-on-adaptive-color-correction-and/10.1117/1.JEI.29.4.043006.short", "paperfrom": "A Yang, Q Wang, Z Ji, J Wang - Journal of electronic imaging, 2020 - spiedigitallibrary.org", "abstract": "… In this paper, we develop an underwater image restoration method based on adaptive \ncolor correction and adaptive transmission fusion strategy, which can be applicable to restore …"}
{"papertitle": "Light Field Image Restoration for Vision in Scattering Media", "paperlink": "https://ieeexplore.ieee.org/abstract/document/8451484/", "paperfrom": "V Varghese, M Bryson, O Pizarro… - … on Image …, 2018 - ieeexplore.ieee.org", "abstract": "… This work proposes an image restoration pipeline based on estimating the backscatter \ncomponent by utilizing the depth selectivity afforded by light field imaging to overcome occluders …"}
{"papertitle": "Bio-inspired optimization algorithms for real underwater image restoration", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0923596518303199", "paperfrom": "C Sánchez-Ferreira, LS Coelho, HVH Ayala… - … Processing: Image …, 2019 - Elsevier", "abstract": "… automatic underwater image restoration in shallow water where sunlight is … image restoration \nstrategies like the one proposed in this work. Section 2.3 discusses some image restoration …"}
{"papertitle": "From image restoration to renewal: Approaches to understanding postcrisis communication", "paperlink": "https://wwwtandfonline.53yu.com/doi/abs/10.1080/15358590903545263", "paperfrom": "MW Seeger, DR Griffin Padgett - The Review of Communication, 2010 - Taylor & Francis", "abstract": "… of research on image restoration and apologetic discourse (… move beyond work in image \nrestoration to better understand the … communication including image restoration and restorative …"}
{"papertitle": "Increasing the accuracy of MODIS/Aqua snow product using quantitative image restoration technique", "paperlink": "https://ieeexplore.ieee.org/abstract/document/6145608/", "paperfrom": "I Gladkova, M Grossberg, G Bonev… - … and Remote Sensing …, 2012 - ieeexplore.ieee.org", "abstract": "… We have previously introduced an algorithm for quantitative image restoration (QIR) that \ncan restore missing pixels or scan lines, using multilinear regression with input from a spatial-…"}
{"papertitle": "Attenuation coefficient guided two-stage network for underwater image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9311705/", "paperfrom": "Y Lin, L Shen, Z Wang, K Wang… - IEEE Signal Processing …, 2020 - ieeexplore.ieee.org", "abstract": "… by adjusting the pixel values of the image, without considering … image restoration, in which \nwe divide the restoration process into two stages: horizontal and vertical distortion restoration. …"}
{"papertitle": "Underwater image restoration using geodesic color distance and complete image formation model", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9178789/", "paperfrom": "E Park, JY Sim - IEEE Access, 2020 - ieeexplore.ieee.org", "abstract": "… This article proposes a novel underwater image restoration algorithm based on the complete \nunderwater image formation model (UIFM). Although the majority of the existing methods …"}
{"papertitle": "A novel dark channel prior guided variational framework for underwater image restoration", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S1047320319303530", "paperfrom": "G Hou, J Li, G Wang, H Yang, B Huang… - … Communication and Image …, 2020 - Elsevier", "abstract": "… A novel total variation method for underwater image restoration is proposed based on the \nunderwater dark channel prior, in which we successfully integrate the underwater image …"}
{"papertitle": "Underwater image restoration by color compensation and color-line model", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0923596521002812", "paperfrom": "X Li, C Lei, H Yu, Y Feng - Signal Processing: Image Communication, 2022 - Elsevier", "abstract": "… An underwater image restoration … image local transmission optimization model is \nestablished in light of the color line law to acquire local transmission map. Finally, the restoration …"}
{"papertitle": "Underwater image restoration by turbulence model based on image gradient distribution", "paperlink": "https://ieeexplore.ieee.org/abstract/document/6319570/", "paperfrom": "M Yang, C Gong - 2012 2nd International Conference on …, 2012 - ieeexplore.ieee.org", "abstract": "… the image transmission in water as a linear system. Image restoration aims at recovering the \noriginal image f (x, y) from the observed image g(x, y) using (if available) explicit knowledge …"}
{"papertitle": "Hyperspectral Image Restoration via Iteratively Regularized Weighted Schatten -Norm Minimization", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7453172/", "paperfrom": "Y Xie, Y Qu, D Tao, W Wu, Q Yuan… - IEEE Transactions on …, 2016 - ieeexplore.ieee.org", "abstract": "… noisy image iteratively; we adopt the iterative regularization scheme in [36], which is to … \nimage restoration with bilateral variance estimation: A low-rank approach,” IEEE Trans. Image …"}
{"papertitle": "Underwater image restoration algorithm for free-ascending deep-sea tripods", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0030399218300732", "paperfrom": "J Li, Y Li - Optics & Laser Technology, 2019 - Elsevier", "abstract": "… In this paper, we designed an image restoration system for in situ deep sea observations \nusing deep-sea observation equipment. The proposed algorithm can improve the quality of …"}
{"papertitle": "Image restoration for confocal microscopy: improving the limits of deconvolution, with application to the visualization of the mammalian hearing organ", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0006349501762145", "paperfrom": "JB De Monvel, S Le Calvez, M Ulfendahl - Biophysical Journal, 2001 - Elsevier", "abstract": "… The image restoration scheme that we investigate in this article is based on applying wavelet \ndenoising to the images before a more classical deconvolution algorithm. This approach …"}
{"papertitle": "Total-variation-regularized low-rank matrix factorization for hyperspectral image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7167714/", "paperfrom": "W He, H Zhang, L Zhang, H Shen - IEEE transactions on …, 2015 - ieeexplore.ieee.org", "abstract": "In this paper, we present a spatial spectral hyperspectral image (HSI) mixed-noise removal \nmethod named total variation (TV)-regularized low-rank matrix factorization (LRTV). In …"}
{"papertitle": "A fast algorithm for edge-preserving variational multichannel image restoration", "paperlink": "https://epubs.siam.org/doi/abs/10.1137/080730421", "paperfrom": "J Yang, W Yin, Y Zhang, Y Wang - SIAM Journal on Imaging Sciences, 2009 - SIAM", "abstract": "… , have long been known to offer superior image restoration quality, but processing speed \nremained … of color image processing. In this paper, by extending the grayscale image deblurring …"}
{"papertitle": "Global low-rank image restoration with Gaussian mixture model", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7959620/", "paperfrom": "S Zhang, L Jiao, F Liu, S Wang - IEEE transactions on …, 2017 - ieeexplore.ieee.org", "abstract": "… put forward for image restoration [16]–[18]. On the other hand, global low-rank methods face \nlots of limitations in image restoration. In general, a global model regards an image as a low-…"}
{"papertitle": "Optimal space-varying regularization in iterative image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/287028/", "paperfrom": "SJ Reeves - IEEE transactions on image processing, 1994 - ieeexplore.ieee.org", "abstract": "… -variant regularization in image restoration provides better results than … image restoration \ntechniques. This method performs nearly as well as the exact criterion for the image restoration …"}
{"papertitle": "Variational Bayesian Image Restoration Based on a Product of -Distributions Image Prior", "paperlink": "https://ieeexplore.ieee.org/abstract/document/4623237/", "paperfrom": "G Chantas, N Galatsanos, A Likas… - … transactions on image …, 2008 - ieeexplore.ieee.org", "abstract": "… is proposed for the image restoration problem that bypasses this difficulty. An image prior \nis … , is used to infer the restored image. Numerical experiments are shown that compare this …"}
{"papertitle": "Image restoration of underwater images using Energy Minimization Algorithm", "paperlink": "http://www.ijctjournal.org/Special-Issues/ICETAC2K17/ICETAC2K17-P6.pdf", "paperfrom": "MB Mahalekshmi, MG Johncy - ijctjournal.org", "abstract": "… image processing in order to improve the image quality. As most of the images of offshore \ninstallations, drinking water … for image restoration from these distortions with good accuracy. …"}
{"papertitle": "An Old Photo Image Restoration Processing Based on Deep Neural Network Structure", "paperlink": "https://www.hindawi.com/journals/wcmc/2022/7415342/", "paperfrom": "R Wang - Wireless Communications and Mobile Computing, 2022 - hindawi.com", "abstract": "… effect of image restoration of old photos and provide more possibilities for restoration of old \n… significance of image restoration methods, designs an image restoration model based on …"}
{"papertitle": "Dynamic positron emission tomography image restoration via a kinetics-induced bilateral filter", "paperlink": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0089282", "paperfrom": "Z Bian, J Huang, J Ma, L Lu, S Niu, D Zeng, Q Feng… - PloS one, 2014 - journals.plos.org", "abstract": "… Considering the variation of the activity value among different image frames, we proposed \na frame-dependent scale parameter form, that is, , to control the image intensity similarity at …"}
{"papertitle": "A polarization-based image restoration method for both haze and underwater scattering environment", "paperlink": "https://wwwnature.53yu.com/articles/s41598-022-05852-1", "paperfrom": "Z Dong, D Zheng, Y Huang, Z Zeng, C Xu, T Liao - Scientific Reports, 2022 - nature.com", "abstract": "… In this article, a method of image restoration for both haze … of a clear image are larger than \nthose of an image in a scattering … Thirdly, two images are fused to form a clear image and the …"}
{"papertitle": "Multi-beam synchrotron infrared chemical imaging with high spatial resolution: Beamline realization and first reports on image restoration", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0168900210028755", "paperfrom": "MJ Nasse, EC Mattson, R Reininger, T Kubala… - Nuclear Instruments and …, 2011 - Elsevier", "abstract": "… Image restoration methods are very commonly used to … Importantly, to achieve improvements \nwith image restoration … Below, we discuss advantages and limitations of two restoration …"}
{"papertitle": "Destination image restoration on facebook: The case study of Nepal's Gurkha Earthquake", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S1447677015300930", "paperfrom": "E Ketter - Journal of Hospitality and Tourism Management, 2016 - Elsevier", "abstract": "… image restoration. To bridge over this gap, the current study analysed the Nepal Tourism \nBoard's use of Facebook to restore its image … as a mean of image restoration and on its unique …"}
{"papertitle": "Single Underwater Image Restoration By Multi-Scale Fusion In Multi-Color Space", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9581847/", "paperfrom": "Z Zhou, L Wang, B Su, J Tang… - 2021 IEEE/ACIS 6th …, 2021 - ieeexplore.ieee.org", "abstract": "… image has the same size as the original underwater image, and the final upsampled image \nis restored underwater image… an up to date underwater image restoration method. And we …"}
{"papertitle": "Underwater image restoration by red channel compensation and underwater median dark channel prior", "paperlink": "https://opg.optica.org/abstract.cfm?uri=ao-61-10-2915", "paperfrom": "J Zhou, D Liu, X Xie, W Zhang - Applied Optics, 2022 - opg.optica.org", "abstract": "… In contrast to existing underwater image restoration methods, we propose an underwater \nimage restoration method with red channel compensation and blue-green channel restoration. …"}
{"papertitle": "Depth-variant image restoration in 3D fluorescence microscopy: Two approaches under gaussian and poissonian noise conditions", "paperlink": "https://ieeexplore.ieee.org/abstract/document/6235899/", "paperfrom": "SB Hadj, L Blanc-Féraud, E Maalouf… - 2012 9th IEEE …, 2012 - ieeexplore.ieee.org", "abstract": "… A commonly used image restoration method in such a situation is the Richardson-Lucy \nalgorithm with total variation regularization (RLTV). We explore this algorithm to simultaneously …"}
{"papertitle": "Underwater image restoration based on exponentiated mean local variance and extrinsic prior", "paperlink": "https://linkspringer.53yu.com/article/10.1007/s11042-021-11269-1", "paperfrom": "S Li, F Liu, J Wei - Multimedia Tools and Applications, 2022 - Springer", "abstract": "… are image restoration based on the underwater optical physical model and image restoration \n… This method can achieve good results of in underwater image restoration under certain …"}
{"papertitle": "Underwater image processing: state of the art of restoration and image enhancement methods", "paperlink": "https://linkspringer.53yu.com/content/pdf/10.1155/2010/746052.pdf", "paperfrom": "R Schettini, S Corchs - EURASIP journal on advances in signal processing, 2010 - Springer", "abstract": "… We have summarized the available methods for image restoration and image enhancement, \nfocusing on the conditions for which each of the algorithms has been originally developed. …"}
{"papertitle": "Integration of stereophotogrammetry with image restoration models for distortion-tolerant viewing through the sea surface", "paperlink": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/1943/0000/Integration-of-stereophotogrammetry-with-image-restoration-models-for-distortion-tolerant/10.1117/12.157138.short", "paperfrom": "MS Schmalz - State-of-the-Art Mapping, 1993 - spiedigitallibrary.org", "abstract": "… is required for trans-MBL image restoration. Glint image analysis, although intuitively attractive \ndue … limit upon sea elevation error admitted by our image restoration models. Laser-based …"}
{"papertitle": "Adaptive neural network for nuclear medicine image restoration", "paperlink": "https://linkspringer.53yu.com/article/10.1023/A:1007997500254", "paperfrom": "W Qian, H Li, M Kallergi, D Song, LP Clarke - … systems for signal, image …, 1998 - Springer", "abstract": "… ’ states which are related to image pixel intensity, … restoration process to improve the \nrestoration results. In this paper, we propose an adaptive neural network (ANN) image restoration …"}
{"papertitle": "Comparative study on several blind deconvolution algorithms applied to underwater image restoration", "paperlink": "https://linkspringer.53yu.com/article/10.1007/s10043-010-0022-7", "paperfrom": "F Fan, K Yang, M Xia, W Li, B Fu, W Zhang - Optical review, 2010 - Springer", "abstract": "… image restoration results. We applied the three algorithms in our image restoration attempt \n… ) as the estimation of image blurring process and selecting the denoised image as the initial …"}
{"papertitle": "Computergraphical model for underwater image simulation and restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/6961271/", "paperfrom": "T Stephan, J Beyerer - … ICPR Workshop on Computer Vision for …, 2014 - ieeexplore.ieee.org", "abstract": "… Hence, this model can be used for efficient simulation and theoretical issues, also \nvisibility ranges dependent on the water properties and for image restoration methods. …"}
{"papertitle": "Fast visibility restoration using a single degradation image in scattering media", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9072525/", "paperfrom": "Y Wang, J Cao, C Xu, S Rizvi, K Li… - IEEE Photonics …, 2020 - ieeexplore.ieee.org", "abstract": "… method for improving degraded image quality in scattering … restoration, and it is robust \nand effective for turbid water outside the atmosphere. Abstract: Visibility restoration of an image …"}
{"papertitle": "Alternative Underwater Image Restoration Based on Unsupervised Learning and Autoencoder with Degradation Block", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9307136/", "paperfrom": "CD Mello, BU Moreira, PLJ Drews… - 2020 Latin American …, 2020 - ieeexplore.ieee.org", "abstract": "… The main contribution of this work is a new unsupervised training methodology to image \nrestoration based on the assumption described above. Our algorithm does not require paired …"}
{"papertitle": "TEM image restoration from fast image streams", "paperlink": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0246336", "paperfrom": "H Wieslander, C Wählby, IM Sintorn - Plos one, 2021 - journals.plos.org", "abstract": "… The purpose is to understand if and how a live image stream can be used to replace the … \ncan pose challenges for image registration. Here, we focus on the image restoration side of this …"}
{"papertitle": "Underwater Image Restoration via Non-Convex Non-Smooth Variation and Thermal Exchange Optimization", "paperlink": "https://www.mdpi.com/1123616", "paperfrom": "Q Jiao, M Liu, P Li, L Dong, M Hui, L Kong… - Journal of Marine …, 2021 - mdpi.com", "abstract": "… water can impact the quality of underwater images. In this paper, a novel underwater image \nrestoration … Finally, the restored image can be estimated via the image formation model. The …"}
{"papertitle": "Periodic integration-based polarization differential imaging for underwater image restoration", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0143816621002554", "paperfrom": "J Wang, M Wan, G Gu, W Qian, K Ren, Q Huang… - Optics and Lasers in …, 2022 - Elsevier", "abstract": "… one of the most effective tools for image restoration in the underwater environment. To … \nand image noise in conventional PDI systems, we propose a new underwater image restoration …"}
{"papertitle": "Omnidirection image restoration using a Support Vector Machine", "paperlink": "https://ieeexplore.ieee.org/abstract/document/4608071/", "paperfrom": "L Liu, Z Cao - 2008 International Conference on Information …, 2008 - ieeexplore.ieee.org", "abstract": "… In this paper we establish omni-directional vision system with fisheye lens and solve the \nproblem of fisheye image distortion. A novel fisheye image restoration algorithm based on SVM, …"}
{"papertitle": "Acceleration of the Retinex algorithm for image restoration by GPGPU/CUDA", "paperlink": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/7872/78720E/Acceleration-of-the-Retinex-algorithm-for-image-restoration-by-GPGPU/10.1117/12.876640.short", "paperfrom": "YK Wang, WB Huang - Parallel Processing for Imaging …, 2011 - spiedigitallibrary.org", "abstract": "… Retinex is an image restoration method that can restore the image’s original appearance. … \nThen a log-domain processing between the original image and the center/surround …"}
{"papertitle": "Social media crisis communication in racially charged crises: Exploring the effects of social media and image restoration strategies", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S074756322030025X", "paperfrom": "A Triantafillidou, P Yannas - Computers in Human Behavior, 2020 - Elsevier", "abstract": "Using a 3 × 4 between-subjects experiment, the present study delineates the effects of \nsocial media platforms (Facebook, Twitter, and Instagram) and image restoration strategies (denial…"}
{"papertitle": "FloodNet: Underwater image restoration based on residual dense learning", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S0923596522000133", "paperfrom": "S Gangisetty, RR Rai - Signal Processing: Image Communication, 2022 - Elsevier", "abstract": "… In this work, we focus on underwater image restoration techniques which is categorized into \nalgorithm-based and learning-based approaches. The algorithm-based approach work on …"}
{"papertitle": "Non-local meets global: An integrated paradigm for hyperspectral image restoration", "paperlink": "https://ieeexplore.ieee.org/abstract/document/9208755/", "paperfrom": "W He, Q Yao, C Li, N Yokoya, Q Zhao… - … on Pattern Analysis …, 2020 - ieeexplore.ieee.org", "abstract": "… Image restoration recovers a desired unknown image from corrupted … process is irreversible, \nimage restoration is usually an ill-… information or a regularizer for image restoration [13], [16]. …"}
{"papertitle": "Artistic color virtual reality implementation based on similarity image restoration", "paperlink": "https://www.hindawi.com/journals/complexity/2021/7572654/", "paperfrom": "X Xu, J Zhu - Complexity, 2021 - hindawi.com", "abstract": "… in an unsatisfactory final restoration result of the image [20]. With the … image restoration \nresearch, and more image restoration methods are bound to emerge. Currently, image restoration …"}
{"papertitle": "Performance analysis and optimization of nonlinear image restoration techniques in spatial domain", "paperlink": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.735.735&rep=rep1&type=pdf", "paperfrom": "L Wanare, DP Shah - International Journal of Image Processing (IJIP), 2012 - Citeseer", "abstract": "… In this section, we briefly review previous work on image restoration, continuous tone image \nmodel and noise modeling. Image restoration techniques differ in the choice of image prior …"}
{"papertitle": "Hyperspectral image restoration by subspace representation with lowrank constraint and spatialspectral total variation", "paperlink": "https://ieeexplore.ieee.org/iel7/4149689/8972491/08972510.pdf", "paperfrom": "J Ye, X Zhang - IET Image Processing, 2020 - ieeexplore.ieee.org", "abstract": "… ‘Total-variation-regularized low-rank matrix factorization for hyperspectral image restoration’… \n‘Hyperspectral image restoration using low-rank representation on spectral difference image…"}
{"papertitle": "A novel adaptive restoration for underwater image quality degradation", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7401946/", "paperfrom": "S Qiu, J Yu, B He, R Nian… - OCEANS 2015-MTS …, 2015 - ieeexplore.ieee.org", "abstract": "… one simplify underwater image restoration model combined with … taken into consideration for \nimage restoration. An adaptive … After this, we develop an adaptive image restoration strategy …"}
{"papertitle": "Underwater Image Restoration Using UICCS Method in Matlab", "paperlink": "https://www.neliti.com/publications/263146/underwater-image-restoration-using-uiccs-method-in-matlab", "paperfrom": "S Bibis, R Aswanth, S Gayatri - International Journal of New Technology and … - neliti.com", "abstract": "… This method can achieve real-time processing a wavelength compensation and scattering \nmethod for underwater image restoration. It is the first time to consider the wavelength …"}
{"papertitle": "Image restoration and analysis of influenza virions binding to membrane receptors reveal adhesion-strengthening kinetics", "paperlink": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0163437", "paperfrom": "DW Lee, HL Hsu, KB Bacon, S Daniel - PLoS One, 2016 - journals.plos.org", "abstract": "… Hence, we developed an effective image restoration … and provide a SPT image restoration \nalgorithm called STAWASP (… our image restoration algorithm and data analysis strategies. …"}
{"papertitle": "Zero-Reference Image Restoration for Under-Display Camera of UAV", "paperlink": "https://arxiv.53yu.com/abs/2202.06283", "paperfrom": "Z Zheng, X Jia, Y Zhuang - arXiv preprint arXiv:2202.06283, 2022 - arxiv.org", "abstract": "… In this study, we endeavor to implement the image restoration task without reference images \nby leveraging the UDC prior rather than considering the high-cost GAN techniques [Jiang et …"}
{"papertitle": "Image restoration method for deep-sea tripod observation systems in the South China Sea", "paperlink": "https://ieeexplore.ieee.org/abstract/document/7401872/", "paperfrom": "H Lu, Y Li, S Serikawa, J Li, Z Liu… - OCEANS 2015-MTS …, 2015 - ieeexplore.ieee.org", "abstract": "… In this paper, we built an image restoration system for insuit deep sea observing in the South \nChina Sea. The proposed scheme can improve the quality of deep-sea images well. It can …"}
{"papertitle": "Characterization of multiphoton laser scanning device optical parameters for image restoration", "paperlink": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5463/0000/Characterization-of-multiphoton-laser-scanning-device-optical-parameters-for-image/10.1117/12.545604.short", "paperfrom": "F Fischer, K Konig, S Puschmann… - Femtosecond Laser …, 2004 - spiedigitallibrary.org", "abstract": "… is known, image restoration tools can be applied to improve image quality. In particular, image \nartifacts … In the last decades a variety of image restoration algorithms were developed10. …"}
{"papertitle": "A method of plant root image restoration based on GAN", "paperlink": "https://sciencedirect.53yu.com/science/article/pii/S2405896319324449", "paperfrom": "J Mi, W Gao, S Yang, X Hao, M Li, M Wang, L Zheng - IFAC-PapersOnLine, 2019 - Elsevier", "abstract": "… real image to the greatest extent. This paper adopted GAN technology to restore the root … \nmissing part of the root image, a method of root image restoration based on GAN is proposed in …"}
{"papertitle": "Image Restoration for Target Behind Inhomogeneous Turbid Medium via Longitudinal Laser Tomography", "paperlink": "https://linkspringer.53yu.com/chapter/10.1007/978-3-319-91659-0_17", "paperfrom": "W Yi, X Wang, Z Shao, M Fu, L Wang, X Li - International Conference on …, 2017 - Springer", "abstract": "… Taking homomorphic filtering as an example, we compare the proposed method with the \nblind digital image restoration algorithms. The Butterworth filter functions [39] for homomorphic …"}
{"papertitle": "Iterative nonlocal total variation regularization method for image restoration", "paperlink": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0065865", "paperfrom": "H Xu, Q Sun, N Luo, G Cao, D Xia - PloS one, 2013 - journals.plos.org", "abstract": "… variation based image restoration is proposed, moreover we present a nonlocal regularization \nunder the … Next, we show some image restoration results of these methods to illustrate the …"}
